{"aff": "Sandia National Laboratories", "name": "Ali Pinar", "avatar": "//static.aminer.org/upload/avatar/1766/896/445/53f43aa9dabfaee43ec58f77.jpeg", "indices": {"num_tobe_confirm_pubs": 0, "num_patents": 0, "diversity": 3.4804, "num_ret_pubs": 0, "activity": 6.9565, "num_activities": 0, "new_star": 0.0156, "sociability": 4.6539, "h_index": 26, "as": 0.0, "num_citation": 2670, "g_index": 50, "num_pubs": 93}, "tags": ["Load Balance", "Directed Graph", "Algorithms", "Data Structure", "Sparse Matrices", "Approximation Algorithm", "Parallel Computer", "Scientific Computing", "Social Network", "Power System"], "pos": "Principal Member", "contact": {"work": "– Principal Member of the Technical Staff (Oct 2008 – )\nSandia National Laboratories\n– Computer Systems Engineer III, (May, 2004 – Oct 2008)\nLawrence Berkeley National Laboratory\n– Postdoctoral Researcher, (Oct, 2001 – May, 2004)\nLawrence Berkeley National Laboratory\n– Visiting Researcher, (summers 1999, 2000)\nSandia National Laboratories\n– Research Assistant, (Aug, 1997 – Aug, 2001)\nDepartment of Computer Science\nComputational Science and Engineering Program, UIUC\n– Teaching Assistant, (Sep, 1994 – July 1997)\nDept. of Computer Engineering and Information Science,\nBilkent University, Ankara,Turkey\nSupervisor for\n• Jianqiang Cheng, 2015–. Universite Paris Sud\n• Madhav Jha, Von Neumann postdoc, 2013–2014, Penn State U.\n• Nurcan Durak, postdoc, 2011–2012, Lousiville U.\n2 of 16\n• David Gleich, Von Neumann postdoc, 2010–2011, Stanford U.\n• Vanessa Lopez, postdoc, 2005–2006, UIUC\n• A. Erdem Sariyuce, summer student, 2014, Ohio State.\n• SM Arifuzzaman, summer student, 2014 Virginia Tech.\n• Chengbin Peng, visiting student, 2014, KAUST\n• Chris Quinn, Krell fellow, 2012, UIUC\n• Christine Task, summer student, 2012, Purdue University\n• Isabelle Stanton, summer student, 2010, UC Berkeley\n• Matthew Rocklin, summer student, 2010, U. Chicago\n• Adam Reichert, summer student, 2006, UIUC\n• Yonatan Fogel, summer student, 2006, State U. New York at Stony Brook\n• Virginia Vassilevska, summer student, 2003, Carnegie Mellon University\n• Manmeet Singh, summer student, 2003, UIUC\n• Tao Tao, summer student, 2002, UIUC\n• Feida Zhu, summer student, 2002, UIUC\n– Teaching Assistant for\n• Algorithms (for senior students)\n• Program Verification (for junior and senior students)\n• Combinatorics and Graph Theory (for junior students)", "homepage": "http://www.sandia.gov/~apinar/", "has_email_cr": true, "bio": "Ali Pinar is a Principal Member of Technical Staff in the Data Science & Cyber Analytics Department at Sandia National Laboratories in Livermore, California. He earned his PhD. in computer science from University of Illinois at Urbana-Champaign and M.S. and B.S degrees in computer science from Bilkent University in Ankara, Turkey. Before joining Sandia, he worked at Lawrence Berkeley National Laboratory (LBNL). His current research interests include modeling and analysis of networks, sampling algorithms on graphs, optimization problems in power systems, in situ analysis of simulation data, and data mining in general. His earlier work focused on combinatorial scientific computing with emphasis on load balancing for parallel computing, sparse matrix computations, interconnection networks, and communication libraries. Ali has been an author for three best paper awards in SDM13, KDD13, and ICDM15.\n\nCurrently, Ali is working on methods to infer global properties of a network from limited samples. The essence of this work is to apply techniques of sublinear algorithms in a practical setting. Such techniques can enable rapid analysis of extremely large data sets, since the algorithms aim to predict global properties of the network by looking at only a small portion of it. Another goal is to infer network properties when only limited data is available. Ali's work has produced several important results. He has co-authored a paper to compute triadic statistics in graphs with a small number samples, which won the best paper prize at the SIAM International Conference on Data Mining (SDM'13). An extension of this work applied similar techniques for triadic analysis on a streaming setting, which won the Best Student Paper Prize at 2013 ACM Knowledge Discovery and Data Mining Conference. More recently, Ali was involved in a project to predict large entries of the product of two matrices using sampling, and this work was recognized with a Best Paper Prize at 2015 IEEE International Conference of Data Mining.\n\nAli's on modeling and analysis of networks resulted in ability to predict community structure in a network using only triadic information. This method led to a Block Two Level Erdos Renyi (BTER) graph model and associated software, which can generate graphs with community stricture at extremely large scales. In other work, he was also involved in analyzing existing models such as Stochastic Kronecker Graphs (SKG), also known as R-MAT.\n\nDuring his tenure at LBNL, Ali built and led a team of power engineers, applied mathematicians, and computer scientists to design methods for vulnerability analysis of the electric power grid. Current standards require the grid to survive the failure of a single component, but multiple failures are common and can have severe consequences. The team designed algorithms to detect multiple contingencies in the network, while avoiding the curse of dimensionality. They then worked to design resilient systems, using the vulnerability results as design constraints. In related work, Ali and colleagues are working on incorporating uncertainty into optimization algorithms to model the impact of intermittent renewable energy sources.\n\nAli's earlier work was in in the application of combinatorial techniques to problems in scientific computing. His work on various problems in sparse matrix computations, load balancing and communication algorithms for parallel computing, and parallel graph algorithms were published in prestigious journals and conference proceedings. He has been active in building this community, e.g. co-chairing the 2011 SIAM Workshop on Combinatorial Scientific Computing.\n\nAli currently serves on the editorial boards of SIAM Journal on Scientific Computing, SIAM News, and Journal of Complex Networks and on SIAM's Committee on Programs and Conferences. He is also elected as the chair SIAM Activity Group on Supercomputing. He has previously served as the program director and the secretary for the same activity group. Ali co-chaired the 2014 SIAM Conference on Parallel Processing for Scientific Computing, has co-chaired several workshops, and has served on numerous program committees. Recently, Dr. Pinar initiated the SIAM workshop series on network science that brings together researchers from different areas of computer science and applied mathematics.", "fax": "(925) 294 2234", "phone": "(925) 294 4683", "affiliation": "Sandia National Laboratories", "has_email": true, "address": "Data Sciences & Cyber Analytics Dept.  Sandia National Laboratories  East Avenue .gov Livermore, CA 94551 USA", "edu": "University of Illinois at Urbana-Champaign (UIUC)\n– Ph.D. in Computer Science, 2001\nwith the option of Computational Science and Engineering\n• Thesis title: “Combinatorial Algorithms in Scientific Computing,”\n• Co-advisors: Michael Heath and Bruce Hendrickson\nBilkent University, Ankara, Turkey\n– M.S. in Computer Engineering and Information Science, 1996\n• Thesis title: “Decomposing Linear Programs for Parallel Solution,”\n• Advisor: Cevdet Aykanat\n– B. S. in Computer Engineering and Information Science, 1994"}, "attr": {"gender": "male", "nation": "USA"}}