{"aff": "University of North Carolina at Chapel Hill\n", "name": "Jaime Arguello", "avatar": "//static.aminer.org/upload/avatar/324/887/64/53f437c6dabfaeb1a7c00bb3.png", "indices": {"g_index": 44, "as": 0.0, "num_activities": 0, "num_pubs": 57, "sociability": 4.3174, "num_tobe_confirm_pubs": 0, "new_star": 13.6159, "activity": 26.7411, "h_index": 22, "diversity": 2.6422, "num_patents": 0, "num_citation": 1977, "num_ret_pubs": 0}, "tags": ["Web Search Result", "Aggregated Search", "Information Retrieval", "Federated Search", "Search Task", "Web Result", "Evaluation", "Query Expansion", "Search Behavior", "Vertical Selection"], "pos": "Assistant Professor\n", "contact": {"fax": "", "has_email_cr": true, "phone": "(919)962-2926", "bio": "Research Interests\n\nI conduct research in Information Retrieval (IR). Within IR, my main focus is on aggregated search, where the goal is to provide search across many different systems, or verticals, from a single search box. From the system side, I develop methods for predicting which verticals to present and where to present them in response to a query. From the human side, I run user studies to better understand search and preference behavior under different situations and with different aggregated search interfaces. In addition to IR, I am also interested in machine learning, text data-mining, and human-computer interaction.\n\nCourses\n\nINLS 509 - Information Retrieval\n\nINLS 609 - Experimental Information Retrieval\n\nINLS 613 - Text Data Mining\n\nFunded Projects\n\nNSF Career: Making Aggregated Search Results More Effective and Useful\n\nNSF-Sponsored Workshop on Task-based Information Search Systems\n\nPublications\n\nDissertation\n\nJaime Arguello. Federated Search in Heterogeneous Environments. Ph.D. Dissertation. Carnegie Mellon University. 2011.\n\nBook Chapter\n\nJaime Arguello and Fernando Diaz. Vertical Selection and Aggregation. In Relevance Ranking and Vertical Search Engines. Elsevier. 2013.\n\nJournal\n\nJaime Arguello, Jamie Callan, and Stuart Shulman. Recognizing Citations in Public Comments. In John Wilkerson and Claire Cardie, editors, Special Issue on Text Annotation for Political Science of the Journal of Information Technology and Politics, 2008.\n\nCarolyn Rosé, Yi-Chia wang, Yue Cui, Jaime Arguello, Karsten Stegmann, Armin Weinberger, Frank Fischer. Analyzing Collaborative Learning Processess Automatically: Exploiting the Advances of Computational Linguistics in Computer Supported Collaborative Learning. International Journal of Computer Supported Collaborative Learning. 3(3). Springer Link. 2008.\n\nConference\n\nDiane Kelly, Jaime Arguello, Ashlee Edwards, and Wan-Ching Wu. Development and Evaluation of Search Tasks for IIR Experiments a Cognitive Complexity Framework To Appear in Proceedings of the 6th International Conference on the Theory of Information Retrieval (ICTIR'15), 2015.\n\nRobert Capra, Jaime Arguello, Anita Crescenzi, and Emily Vardell. Differences in the Use of Search Assistance for Tasks of Varying Complexity In Proceedings of the 38th Annnual International ACM SIGIR Conference on Research & Development on Information Retrieval (SIGIR'15), 2015.\n\nJaime Arguello and Kyle Shaffer. Predicting Speech Acts in MOOC Forum Posts. In Proceedings of the 9th International Conference on Web and Social Media (ICWSM'15), 2015.\n\nJaime Arguello. Improving Aggregated Search Coherence. In Proceedings of the 37th European Conference in Information Retrieval (ECIR'15), 2015.\n\nJaime Arguello and Robert Capra. The Effects of Rank and Border on Aggregated Search Coherence and Search Behavior. To appear in Proceedings of the 23rd ACM International Conference on Information and Knowledge Management (CIKM'14), 2014.\n\nJaime Arguello. Predicting Search Task Difficulty. In Proceedings of the 36th European Conference in Information Retrieval (ECIR'14), 2014.\n\nKathy Brennan, Diane Kelly, and Jaime Arguello. The Effect of Cognitive Abilities on Information Search for Tasks of Varying Levels of Complexity. In Proceedings of the 4th Information Interaction In Context Symposium (IIiX'14), 2014. (Best Paper Award)\n\nJaime Arguello, Robert Capra, and Wan-Ching Wu Factors Affecting Aggregated Search Coherence and Search Behavior. In Proceedings of the 22nd ACM International Conference on Information and Knowledge Management (CIKM'13), 2013.\n\nRobert Capra, Jaime Arguello, and Falk Scholer Augmenting Search Result Surrogates with Images. In Proceedings of the 22nd ACM International Conference on Information and Knowledge Management (CIKM'13), 2013.\n\nJaime Arguello and Robert Capra. The Effect of Aggregated Search Coherence on Search Behavior. In Proceedings of the 21st ACM International Conference on Information and Knowledge Management (CIKM'12), 2012.\n\nJaime Arguello, Wan-Ching Wu, Diane Kelly, and Ashlee Edwards. Task Complexity, Vertical Display, and User Interaction in Aggregated Search. In Proceedings of the 35th Annnual International ACM SIGIR Conference on Research & Development on Information Retrieval (SIGIR'12), 2012.\n\nRobert Capra, Annie T. Chen, Katie Hawthorne, Jaime Arguello, Lee Shaw, and Gary Marchionini. Design and Evaluation of a System to Support Collaborative Search. In Proceedings of the 75th Annual Meeting of the American Society of Information Science and Technology. (ASIST'12), 2012.\n\nJaime Arguello, Fernando Diaz, and Jamie Callan. Learning to Aggregate Vertical Results into Web Search Results. In Proceedings of the 20th ACM Conference on Information and Knowledge Management (CIKM'11) (An extended version of this paper is provided here).\n\nJaime Arguello, Fernando Diaz, Jamie Callan, and Ben Carterette. A Methodology for Evaluating Aggregated Search Results. In Proceedings of the 33rd European Conference on Information Retrieval. (ECIR'11), 2011. (Best Student Paper Award)\n\nJaime Arguello, Fernando Diaz, and Jean-François Paiement. Vertical Selection in the Presence of Unlabeled Verticals. In Proceedings of the 33rd Annual International ACM SIGIR Conference on Research & Development on Information Retrieval (SIGIR'10), 2010.\n\nJaime Arguello, Jamie Callan, and Fernando Diaz. Classification-based Resource Selection. In Proceedings of the 18th ACM Conference on Information and Knowledge Management (CIKM'09), 2009.\n\nJaime Arguello, Fernando Diaz, Jamie Callan, and Jean-François Crespo. Sources of Evidence for Vertical Selection. In Proceedings of the 32nd Annual International ACM SIGIR Conference on Research & Development on Information Retrieval (SIGIR'09), 2009. (Best Paper Award)\n\nFernando Diaz and Jaime Arguello. Adaptation of Offline Vertical Selection Predictions in the Presence of User Feedback.. In Proceedings of the 32nd Annual International ACM SIGIR Conference on Research & Development on Information Retrieval (SIGIR'09), 2009.\n\nJonathan Elsas, Jaime Arguello, Jamie Callan, and Jaime Carbonell. Retrieval and Query Expansion Models for Blog Feed Search. In Proceedings of the 31st Annual International ACM SIGIR Conference on Research & Development on Information Retrieval (SIGIR'08), 2008.\n\nJaime Arguello, Jonathan Elsas, Jamie Callan and Jaime Carbonell. Document Representation and Query Expansion Models for Blog Recommendation. In Proceedings of the 2nd International Conference in Weblogs and Social Media (ICWSM'08), 2008 (Best Paper Nomination)\n\nJaime Arguello and Jamie Callan. A Bootstrapping Approach for Identifying Stakeholders in Public-Comment Corpora. In Proceedings of the 8th Annual International Conference in Digital Government Research (DG.O'07), 2007.\n\nJaime Arguello and Carolyn Rosé. Museli: A Multi-source Evidence Integration Approach to Topic-Segmentation of Dialogue. In Proceedings of the Human Language Technology Conference of the NAACL, Companion Volume: Short Papers (HLT-NAACL'06), 2006. (Short Paper)\n\nJaime Arguello, Brian Butler, Lisa Joyce, Robert Kraut, Kimberly Ling, Carolyn Rosé, and Xiaoqing Wang. Talk to Me: Foundations of Successful Individual-Group Interactions in Online Communities. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI'06), 2006.\n\nCarolyn Rosé, Carol Pai, and Jaime Carguello. Enabling Non-Linguists to Author Advanced Conversational Interfaces Easily. In Proceedings of the 18th International FLAIRS Conference, 2005.\n\nWorkshop\n\nSandeep Avula and Jaime Arguello. Query-expansion Approaches for Microblog Retrieval. In Proceedings of the 24th Text REtrieval Conference (TREC'15), National Institute of Standards and Technology, special publication, 2015.\n\nSandeep Avula, John O'Connor, and Jaime Arguello. A Nearest-Neighbor Approach to Contextual Suggestion. In Proceedings of the 22nd Text REtrieval Conference (TREC'13), National Institute of Standards and Technology, special publication, 2013.\n\nCraig Willis, Richard Medlin, and Jaime Arguello. Incorporating Temporal Information in Microblog Retrieval. In Proceedings of the 21st Text REtrieval Conference (TREC'12), National Institute of Standards and Technology, special publication, 2012.\n\nJaime Arguello, Jonathan Elsas, Changkuk Yoo, Jamie Callan, and Jaime Carbonell. Document and query expansion models for blog distillation. In Proceedings of the 17th Text REtrieval Conference (TREC'08), National Institute of Standards and Technology, special publication, 2008.\n\nJonathan Elsas, Jaime Arguello, Jamie Callan, and Jaime Carbonell. Retrieval and Feedback Models for Blog Distillation. In Proceedings of the 16th Text REtrieval Conference (TREC'07), National Institute of Standards and Technology, special publication, 2007. (Best Performing System)\n\nJaime Arguello and Carolyn Rosé. Topic Segmentation of Dialogue. In Proceedings of the HLT-NAACL 2006 Workshop on Analyzing Conversations in Text and Speech, 2006. (Workshop Paper)\n\nGahgene Gweon, Jaime Arguello, Carol Pai, Regan Carey, Zachary Zaiss, and Carolyn Rosé. Towards a Prototyping Tool for Behavior-Oriented Authoring of Conversational Agents for Educational Applications. In Proceedings of the ACL 2005 Second Workshop for Building Educational Application using NLP, 2005. (Workshop Paper)\n\nTutorials\n\nJaime Arguello, Fernando Diaz, and Milad Shokouhi. Integrating and Ranking Aggregated Content on the Web. In Companion of the Proceedings of the 21st World Wide Web Conference (WWW'12), 2012. (Tutorial)\n\nPosters\n\nAnita Crescenzi, Robert Capra, and Jaime Arguello. Time Pressure, User Satisfaction, and Task Difficulty. In Proceedings of American Society for Information Science and Technology Annual Meeting (ASIS&T 2013) (ASIST'13), 2013.\n\nWan-Ching Wu, Diane Kelly, Ashlee Edwards, and Jaime Arguello. Grannies, Tanning Beds, Tattoos and NASCAR: Evaluation of Search Tasks with Varying Levels of Cognitive Complexity. In Proceedings of the 4th Information Interaction In Context Symposium (IIiX'12), 2012. (Best Poster Award)\n\nDemos\n\nRobert Capra, Jaime Arguello, Annie Chen, Katie Hawthorne, Gary Marchionini, and Lee Shaw. The ResultsSpace Collaborative Search Environment. In Proceedings of the ACM/IEEE Joint Conference on Digital Libraries. (JDCL'12), 2012. (Demonstration Paper)\n\nJaime Arguello and Carolyn Rosé. InfoMagnets: Making Sense of Corpus Data. In Proceedings of the Human Language Technology Conference of the NAACL, Companion Volume: Demonstrations (HLT-NAACL'06), 2006. (Demonstration Paper)", "edu": "Ph.D., Language Technologies\nAdvisor: Dr. Jamie Callan\nLanguage Technologies Institute, School of Computer Science\nCarnegie Mellon University\nM.S., Language Technologies\nAdvisor: Dr. Carolyn Rosé\nLanguage Technologies Institute, School of Computer Science\nCarnegie Mellon University\nM.S., Information Systems Management\nSchool of Information Systems and Management\nHeinz College\nCarnegie Mellon University\nB.S., Electrical Engineering\nMinor, Economics\nWashington University (St. Louis, MO)", "address": "School of Information & Library Science\n307 Manning Hall\nUniversity of North Carolina at Chapel Hill\nChapel Hill, NC 27599-3360\n", "affiliation": "University of North Carolina at Chapel Hill\n", "homepage": "http://www.ils.unc.edu/~jarguell/", "has_email": true, "work": "Assistant Professor\nSchool of Information & Library Science\n \nUniversity of North Carolina at Chapel Hill"}, "attr": {"nation": "USA", "ethnic": "English", "gender": "male", "lang": "English"}}